[
    {
        "State": "Alabama",
        "Content": "Remote Online Notarization became permanent in Alabama in July, 2021 due to Senate Bill 275.  Remote Online Notaries in Alabama area required to keep their traditional commission up to date as well as select a secure RON platform that meets state requirements."
    },
    {
        "State": "Arizona",
        "Content": "Remote Online Notarization is legal in Arizona and has been since March of 2020.  This was due to Senate Bill 1030, which was expedited to Covid-2019 with the signing of AZ Executive Order 2020-26.  Notaries in Arizona are required to apply to perform RON in addition to of course having their commission from the Secretary of State."
    },
    {
        "State": "California",
        "Content": "Remote Online Notarization is yet to be made legal in California.  Notaries and RON vendors alike are anxiously waiting for laws to pass and the floodgates to open on nearly 1/5 of the US population.  We will see if California comes around first, or if federal laws act first with the SECURE Remote Online Notarization Act."
    },
    {
        "State": "Colorado",
        "Content": "Remote Notarization became legal in the state of Colorado in on New Years Eve 2020 due to Senate Bill 20-096. After a temporary measure allowed Remote Notarization due to Covid-19, many Colorado Notaries did not want to abandon the practice.  Colorado notaries are required to have a traditional notary commision as well as pass a RON training course and exam in order to apply for a separate ONLINE notary commission."
    },
    {
        "State": "Florida",
        "Content": "Florida has some of the most advanced laws in the union for Remote Online Notarization.  As one of the first states to allow biometrics, Florida makes it easy for their notaries to get clients into a session and on their way.  The Florida RON statute was put into effect as of January 1, 2020 when the “Electronic Legal Documents” was signed into law (Chapter 2019-71, Laws of Florida).  Florida notaries are required to contract with a 3rd party vendor before they register as a Remote Online Notary Public through Florida's Department of State’s Division of Corporations."
    },
    {
        "State": "Georgia",
        "Content": "Remote Online Notarization is not yet legal in Georgia for their notaries.  Most recently it was tabled and then defeated in their local state legislative sessions.  Georgia is an \"Attorney Only State for Closing.  At last speaking with their state department, we were informed that \"RON and Electronic Signatures are not permitted right now, and there is no timeline, but it could be sometime early next year\". Rule 560-1-1-.14 Electronic Signature and Remote Notary does outline rules for documents that are notarized from remotely from outside of Georgia for those relevant within the state."
    },
    {
        "State": "Idaho",
        "Content": "For Idaho, as of January 1st, 2020, Remote Online Notary laws became permanant thanks to ID Senate Bill 1111. Remote online notaries in Idaho must have a current traditional notary commission and are also required to apply for online notarization authorization with the Idaho Secretary of State."
    },
    {
        "State": "Illinois",
        "Content": "Illinois Remote Online Notarization has been the subject of much debate on the internet.  While some of our competitors may claim that it is already legal on their site in Illinois, more than a handful of direct conversations with the Illinois Secretary of State Office would prove otherwise.  We eagerly await for when Illinois' Remote Online Notarization Laws kick into full effect.  Here you can find an official Illinois letter regarding RON plans and the offical proposals [2022 Illinois Register Issue 16 (ilsos.gov)]"
    },
    {
        "State": "Kansas",
        "Content": "Online Notarization law was enacted in January of 2022 due to Senate Bill 106.  This came in response to the COVID-19 pandemic.  Notaries are required to have a traditional notary commission as well as pass a RON training course and exam.  They also need to apply for a separate notary commission through the Kansas Secretary of State."
    },
    {
        "State": "Kentucky",
        "Content": "Remote Online Notarization services are legal as of January, 2020.  This is due to Senate Bill 114, which was expedited in response to the Covid-19 Pandemic.  Kentucky notaries are required to have a $1000 surety bond, register with the Kentucky Secretary of State and of course have their traditional Notary commission."
    },
    {
        "State": "Louisiana",
        "Content": "Remote Online Notarization became legal in Louisiana in February of 2022 thanks to House Bill 274."
    },
    {
        "State": "Maryland",
        "Content": "Remote Online Notarization became legal in October of 2020 thanks to Senate Bill 678.  Maryland has strict laws requiring Remote Online Notarization Vendors.  They require businesses to have been in business for 3 years.  Remote Online Notaries in Maryland are required to contract with a RON technology provider and of course a present commission."
    },
    {
        "State": "Massachusetts",
        "Content": "Although online notarization was temporarily made legal due to Covid-19 with Chapter 71 of “An Act Providing for Virtual Notarization to Address Challenges Related to COVID-19”, the act has expired and not renewed as of July 2022."
    },
    {
        "State": "Michigan",
        "Content": "Michigan was one of the few states ahead of the curve that had Remote Online Notarization Laws enacted prior to COVID-19, though it wasn't fully fledged at that point.  House Bills 6294, 6295, 6296, and 6297 expanded Remote Online Notary Laws in Michigan and allowed for permanent RON in the state.  Michigan notaries can only work with Michigan Approved RON vendors and have a valid commission."
    },
    {
        "State": "Minnesota",
        "Content": "Remote Online Notarization in became permanently legal in January of 2019 under Senate File 893. For further clarification regarding laws and procedures for Notarization in Minnesota, please refer to Minnesota Satutes 357, 358, and 359."
    },
    {
        "State": "Mississippi",
        "Content": "Remote Online Notarization has been temporarily legal since April, 2020 due to the MS Executive Order No. 1467. Notaries need to notify the Secretary Of State of their intentions to perform remote notary services in Mississippi in addition to possessing a traditional notary commission."
    },
    {
        "State": "Missouri",
        "Content": "As of August 2020, Online Remote Notarization in Missouri has been legal in a limited capacity due to House Bill 1655.  Missouri notaries are required to have a current traditional commission, enroll in a training course and successully pass the Missour notary online test."
    },
    {
        "State": "Montana",
        "Content": "Montana has some of the more progressive Remote Online Notarization laws in the union.  They are one of the first states in the union to adopt Biometric Verification as a form of ID Proofing.  Montana online notary law bhas been permanent since clear back in October 2019 thanks to Montana House Bill 370.  Montana notaries are required to do 4 hours of training and pass an online exam.  They also have to file an application with the Secretary of State and hold a traditional notary commission."
    },
    {
        "State": "Nevada",
        "Content": "Remote Online Notarizatoin services are legal for commissioned notaries in Nevada who have special online notarization.  Nevada Remote Online Notarization (RON) has been legal since pre-covid back in December, 2018 due to NV Assembly Bill 413. This makes it one of the first states to adopt the practice.  Nevada remote notaries must receive authorization from the Secretary Of State, as well as hold a current traditional notary commission and contract with an approved RON technology provider (like BlueNotary!)."
    },
    {
        "State": "New Jersey",
        "Content": "Remote Online Notarization is legal in New Jersey for specialized notaries commissioned to practice RON.  Remote Online Notarization in New Jersey became permanent in October, 2021 thanks to Assembly Bill 4250. New Jersey notaries are requred to hold a traditional notary commission and need to notify the State Treasurer of their intentions to perform remote notary services in New Jersey. New Jersey is one of the only states that allows Biometrics for RON."
    },
    {
        "State": "New York",
        "Content": "New York hopped on the legality train of Remote Online Notarization has been legal since February 2022.  This was ratified with NY Senate Bill 1780C.  Currently any notaries with a traditional norarization can also perform Remote Online Notarization services."
    },
    {
        "State": "North Carolina",
        "Content": "Remote Online Notarization services will not become effective prior to July 1, 2023 for North Carolina Notaries.  This bill is NC House Bill 776.  Notaries will need to notify their SoS and inform them of their intentions to perform remote notary services in North Carolina."
    },
    {
        "State": "Ohio",
        "Content": "Remote Online Notarization has been legal for Ohio Notaries since September of 2019.  The laws were made permant with the Notary Public Modernization Act (SB263).  Notaries in Ohio need to have up to date traditional notary commissions as well as authorization through an application with the SOS.  To get this authorization notaries also need to take a two-hour training course."
    },
    {
        "State": "Oklahoma",
        "Content": "Remote Online Notarization (RON) is legal in Oklahoma for commission notaries in Oklahoma as long as they are also commissioned to practice online notarization.  Oklahoma Online Notary laws became permanent in 2019, thanks to Senate Bill 915.  Oklahoma remote must receive authorization through their state Secretary of State and they must have a contract with a RON technology provider and of course they need an up to date notary commission."
    },
    {
        "State": "Oregon",
        "Content": "Oregon was the 35th state to successfully and permanently enact Remote Online Notarization (RON) in June of 2021 under Senate Bill 765.  The bill was signed after the temporarty House Bill 4212A temporariliy allows Remote Online Notarization.  Oregon, like many states requires that notaries pass extra training and certification to perform Remote Online Notarization."
    },
    {
        "State": "Pennsylvania",
        "Content": "Senate Bill 841 was temprarily authorized due to COVID-19 in April of 2020 to enable Remote Online Notarization (RON).  In October of the 2021, the Governor signed Act 97 into law, allowing online notarization to become a permanent part of Pennsylvania Law.  Pennsylvania notaries must complete an application approved by the Department of State's Bureau of Elections and Notaries to provide RON services. Of course, they must also have an up to date commission as a traditional notary as well."
    },
    {
        "State": "Tennessee",
        "Content": "Remote Online Notarization services have been legal in Tennessee for notaries as of 2019.  This is due to Senate Bill 1758 that took effect in July, 2019.  Online notaries wishing to practice in iTennesee must have an up to date traditional notary commission and somplete an application for RON through the Secretary of State."
    },
    {
        "State": "Texas",
        "Content": "Remote Online Notarization is legal in Texas and has been for quite some time.  Texas was the 3rd state to enact laws supporting RON services back in 2018.  Notaries who provide RON services out of Texas also need to attain an online notary commission through the Texas Secretary of State."
    },
    {
        "State": "Utah",
        "Content": "Utah Remote Online Notarization laws were passed in November, 2019 with House Bill 52.  Notaries in Utah need a separate online notary commission in addition to their traditional notary commission.  They also need to pass a background check when they submit their online commission application."
    },
    {
        "State": "Vermont",
        "Content": "Remote Online Notarization is legal for notaries in Vermont thanks to the VT Emergency Remote Notarial Act.  Notaries are required to hold a traditional notary commission and need to notify the Secretary of State of their intentions to perform remote online notarization (RON) in Vermont."
    },
    {
        "State": "Virginia",
        "Content": "Virginia was the first state in the union to apply Remote Online Notarization (RON) laws clear back in 2013.  This law (House Bill 2318/Senate Bill 827).  Virginia is also one of the first states to allow Biometrics for RON Identity Proofing.  Online Notaries are required to have traditional notary commissions as well as have an approved application to perform Remote Online Notarization sercives."
    },
    {
        "State": "Washington",
        "Content": "Washington Remote Online Notarization laws were enacted in March of 2020.  The laws were originally scheduled to take effect in October 2020, but Covid-19 changed this.  Online notaries are required to have a traditional notary commission and must be approved by the department of licensing to perform remote services.  Washington was the 9th state to legalize Remote Online Notarization (RON)."
    },
    {
        "State": "West Virginia",
        "Content": "West Virginia legalized Remote Online Notarization with the Senate Bill 469.  Remote Online Notarization in West Virginia must have an up to date notary commission.  They also must inform their Secretary of State of their intent to begin performing Remote Online Notarization."
    }
]